package com.zxu.masterofpainting;

public class Constants {

    public static String ingredientsName;
    public static String ingredientsNutrution;
    public static String ingredientsEfficiency;
    public static String ingredientsSuitableCollocation;
    public static final String[] labelNameMenu = {"美容","减肥","经期","孕妇","食疗","婴儿妈妈","辛苦的爸爸","保健调养","补养","节气","人群功效",};
    public static final String[][] labelMenuContent = {{"美容","养颜","排毒","抗皱","祛斑","美白","润肤","延缓衰老","护发","去黑眼圈","祛痘"}
    ,{"减肥","瘦身","瘦脸","瘦腿","丰胸"}
    ,{"经期","月经不调","痛经"}
    ,{"怀孕第1周","怀孕第2周","怀孕第3周","怀孕第4周","怀孕第5周","怀孕第6周","怀孕第7周","怀孕第8周","怀孕第9周","怀孕第10周"
            ,"怀孕第11周","怀孕第12周","怀孕第13周","怀孕第14周","怀孕第15周","怀孕第16周","怀孕第17周","怀孕第18周","怀孕第19周"
            ,"怀孕第20周","怀孕第21周","怀孕第22周","怀孕第23周","怀孕第24周","怀孕第25周","怀孕第26周","怀孕第27周","怀孕第28周"
            ,"怀孕第29周","怀孕第30周","怀孕第31周","怀孕第32周","怀孕第33周","怀孕第34周","怀孕第35周","怀孕第36周","怀孕第37周"
            ,"怀孕第38周","怀孕第39周","怀孕第40周"}
    ,{"高血糖","高血压","高血脂","低血糖","胆固醇高","胃炎","腹泻","咳嗽","口腔溃疡","消化不良","便秘","肾亏","止咳","发烧","降火","缺钾","中暑","热感冒"
            ,"咳嗽有痰","扁桃体发炎","对抗雾霾"}
    ,{"备孕","怀孕初期","怀孕中期","怀孕晚期","坐月子"}
    ,{"解酒","脱发","口臭","失眠","健忘","抑郁","瘦肚子","上火","抗疲劳","压力大","加快代谢"}
    ,{"清热去火","疏肝理气","明目","防辐射","健脑益智","降血压","降血糖","降血脂","增强免疫力","手术恢复"}
    ,{"补肾","养胃","补血","健脾","养肝","补气血","养肺","补脑","人流","滋阴补水"}
    ,{"立春","雨水","惊蛰","春分","清明","谷雨","立夏","小满","芒种","夏至","小暑","大暑","立秋","处暑","白露","秋分","寒露"
            ,"霜降","立冬","小雪","大雪","冬至","小寒","大寒"}
    ,{"术后","更年期","月经不调","小儿遗尿","阳痿早泄","通乳","产后调理","月经","怀孕","小孩咳嗽","怀孕初期","哺乳期","胆结石"
            ,"月经量少","流产后","孕妇便秘","宫寒","痔疮手术后","孕妇催乳下奶","催乳","下奶"}};

}
